---
kind: property
id: P:Autodesk.Revit.DB.TriangulatedShellComponent.VertexCount
source: html/0c34fc54-c60b-f974-6781-8d2471c6d8e2.htm
---
# Autodesk.Revit.DB.TriangulatedShellComponent.VertexCount Property

The number of vertices in the triangulation.

## Syntax (C#)
```csharp
public int VertexCount { get; }
```